{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"keras_tensor_8": {"name": "keras_tensor_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/loop_counter", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/Max", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "keras_tensor_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1/num_elements"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1/num_elements"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/Cast", "op": "Cast", "input": ["keras_tensor_8"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/Cast", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/Cast", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/Less", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/add", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/SelectV2", "StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1_1/embedding_1_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/Shape", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/strided_slice", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/packed", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/time", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8yXzEvd2hpbGU="}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_19", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_54"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_22", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_17", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_16", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_20", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_21", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_56"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_18", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_53"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/input_control_node/_102", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_23", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_24", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_25", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_27", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_28", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_29", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_30", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_31", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_32", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_27", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_28", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/input_control_node/_102"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/input_control_node/_102"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_29", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less_1", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/cond/_14/sequential_1_1/lstm_2_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_28", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_27", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_32", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_33", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/time_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_29", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_31", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/merge/_30", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_body_control/_42", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter_switch/_35:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1_switch/_40"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_41"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/time_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_switch/_39"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1_switch/_38"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max_switch/_36", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_41", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2_1_switch/_38", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/time_switch/_37", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_body_control/_42", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1_switch/_40", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_switch/_39", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_23", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_24", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_25"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/exit/_46", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "200"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input/_117", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/time_switch/_37:1", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_23", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_24", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/enter/_25", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/loop_counter_switch/_35:1", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input/_117", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input/_117", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_switch/_39:1", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "grad_b": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/output_control_node/_135", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/transpose_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/output_control_node/_135", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/Max_switch/_36:1", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/output_control_node/_135", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/input_control_node/_114"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/output_control_node/_135", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/add", "^Func/StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/output_control_node/_135", "^StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/Shape", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/strided_slice", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/packed", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/LoopControlInputs/_70", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros", "^StatefulPartitionedCall/sequential_1_1/lstm_3_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/StatefulPartitionedCall/sequential_1_1/lstm_2_1/zeros_1_switch/_40:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/sequential_1_1/lstm_2_1/while/body/_15/sequential_1_1/lstm_2_1/while/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/enter/_60", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/loop_counter", "^StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/LoopControlInputs/_70"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8zXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1_1/lstm_3_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/LoopControlInputs/_70"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xXzEvbHN0bV8zXzEvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/lstm_3_1/while/enter/_61", "op": "Enter", 